Revit 2024 API
TessellatedShapeBuilder.LogString Property
 String used for logging, if any. Usually the name of the file from which face sets were imported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public string LogString { get; set; }
Visual Basic
Public Property LogString As String
	Get
	Set
Visual C++
public:
property String^ LogString {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace